In [2]:
import pandas as pd
import matplotlib.pyplot as plt

# Optional: Display plots inside notebook
%matplotlib inline

In [9]:
# Load the raw EV sales data
sales_df = pd.read_csv('EV_Data/ev_sales.csv')

# Show the first few rows
sales_df.head()

                                           ev_sales_template
Month   BYD_Sales Tesla_Sales Wuling_Sales             Notes
2024    3194721   657102      471515                     NaN
2025-01 115309    25694       37054                      NaN
2025-02 283252    60480       69282           Lunar New Year
2025-03 513703    134607      125174                     NaN

In [13]:
#Fix the Date Format
#For sorting and plot time series charts later
sales_df = pd.read_csv('EV_Data/ev_sales.csv', header=1)
sales_df.head()
sales_df['Month'] = pd.to_datetime(sales_df['Month'], format='mixed')

In [14]:
sales_df.head()

       Month  BYD_Sales  Tesla_Sales  Wuling_Sales           Notes
0 2024-01-01    3194721       657102        471515             NaN
1 2025-01-01     115309        25694         37054             NaN
2 2025-02-01     283252        60480         69282  Lunar New Year
3 2025-03-01     513703       134607        125174             NaN
4 2025-04-01     692667       163338        165746             NaN

In [15]:
sales_df.rename(columns={
    'Month': 'Date',
    'BYD_Sales': 'BYD',
    'Tesla_Sales': 'Tesla',
    'Wuling_Sales': 'Wuling'
}, inplace=True)

In [16]:
print(sales_df.info())
print(sales_df.isnull().sum())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    6 non-null      datetime64[ns]
 1   BYD     6 non-null      int64
 2   Tesla   6 non-null      int64
 3   Wuling  6 non-null      int64
 4   Notes   1 non-null      object
dtypes: datetime64[ns](1), int64(3), object(1)
memory usage: 372.0+ bytes
None
Date      0
BYD       0
Tesla     0
Wuling    0
Notes     5
dtype: int64

In [17]:
#Save cleaned file
sales_df.to_csv('EV_Data/ev_sales_cleaned.csv', index=False)